/*
Вывести последовательность d[k], d]k–1], …, d[0] десятичных цифр
числа 3^200, т.е. такую целочисленную последовательность, в которой
каждый член d[i] удовлетворяет условиям:
1) 0 <= d[i] <= 9;
2) d[k] * 10^k + d[k–1] * 10^(k–1) + ... + d[0] = 3^200.
*/


#include <iostream>

using namespace std;

int main() {
	int n[2000];

	n[0] = 1;
	n[1] = 1;

	for (int p = 0; p < 200; ++p) {
		int b = 0;

		for (int i = 1; i <= n[0]; ++i) {
			b += n[i] * 3;
			n[i] = b % 10;
			b /= 10;
		}

		if (b != 0) {
			n[0]++;
			n[n[0]] = b;
		}
	}

	cout << "3^200 = ";

	for (int i = n[0]; i >= 1; --i) {
		cout << n[i];
	}
	cout << endl;

	return 0;
}