/*
Можно ли с поля (k, l) одним ходом коня попасть на поле (m, n)?
Если нет, выяснить, как это можно сделать за два хода.
*/


#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");

    int x1, y1, x2, y2;

    cout << "Введите 4 координаты:" << endl;
    cin >> x1;
    cin >> y1;
    cin >> x2;
    cin >> y2;

    if (((abs(x2 - x1) == 1) && (abs(y2 - y1) == 2)) || ((abs(x2 - x1) == 2) && (abs(y2 - y1) == 1))) {
        cout << "С поля (" << x1 << "; " << y1 << ") можно одним ходом попасть на поле (" << x2 << "; " << y2 << ")" << endl;
    }
    else {
        cout << "С поля (" << x1 << "; " << y1 << ") нельзя одним ходом попасть на поле (" << x2 << "; " << y2 << ")" << endl;
        cout << "Варианты для двух ходов в требуемое поле:" << endl;

        bool flag = true;

        for (int i = 1; i <= 8; ++i) {
            for (int j = 1; j <= 8; ++j) {
                if ((((abs(i - x1) == 1) && (abs(j - y1) == 2)) || ((abs(i - x1) == 2) && (abs(j - y1) == 1))) &&
                    (((abs(x2 - i) == 1) && (abs(y2 - j) == 2)) || ((abs(x2 - i) == 2) && (abs(y2 - j) == 1)))) {
                    flag = false;

                    cout << "(" << x1 << "; " << x2 << ") --> (" << i << "; " << j << ") --> (" << x2 << "; " << y2 << ")" << endl;
                }
            }
        }

        if (flag) {
            cout << "Таких вариантов нет" << endl;
        }
    }

    return 0;
}